EDTtest/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Страна</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВебСайт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдЧата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDTtest/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
//////////////////////////////////////////////////////////////////////////////// 
// ОБРАБОТЧИКИ СОБЫТИЙ
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

#Если НЕ МобильныйАвтономныйСервер Тогда
	ПолучитьИдентификаторПользователяСистемыВзаимодействия();
#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////// 
// ПРОЦЕДУРЫ И ФУНКЦИИ 
//

#Если НЕ МобильныйАвтономныйСервер Тогда
	
&НаСервере
Процедура ПолучитьИдентификаторПользователяСистемыВзаимодействия()

	Если НЕ Объект.Ссылка.Пустая() И
		НЕ ПустаяСтрока(Объект.ЭлектроннаяПочта) И
		СистемаВзаимодействия.ИспользованиеДоступно() Тогда

		ОтборПользователей = Новый ОтборПользователейСистемыВзаимодействия;
		ОтборПользователей.Заблокирован = Ложь;
		ОтборПользователей.АдресЭлектроннойПочтыДляАутентификации = Объект.ЭлектроннаяПочта;
		ОтобранныеПользователи = СистемаВзаимодействия.ПолучитьПользователей(ОтборПользователей);

		Если ОтобранныеПользователи.Количество() = 1 Тогда
			ИдентификаторПользователяСистемыВзаимодействия = ОтобранныеПользователи[0].Идентификатор;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПригласитьКонтрагентаВСистемуВзаимодействия()

	Если ИдентификаторПользователяСистемыВзаимодействия = Неопределено Тогда
		ПолучитьИдентификаторПользователяСистемыВзаимодействия();
	КонецЕсли;

	Если ИдентификаторПользователяСистемыВзаимодействия = Неопределено Тогда
		СоздатьИдентификаторПользователяСистемыВзаимодействия();
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	Если НЕ ИдентификаторПользователяСистемыВзаимодействия = Неопределено Тогда
		Попытка
			СистемаВзаимодействия.ОтправитьНавигационнуюСсылкуВнешнегоДоступа(ИдентификаторПользователяСистемыВзаимодействия);
			Возврат Истина;
		Исключение
			Возврат Ложь;
		КонецПопытки;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

&НаСервере
Процедура СоздатьИдентификаторПользователяСистемыВзаимодействия()

	УстановитьПривилегированныйРежим(Истина);

	Если НЕ Объект.Ссылка.Пустая() И
		НЕ ПустаяСтрока(Объект.Наименование) И
		НЕ ПустаяСтрока(Объект.ЭлектроннаяПочта) И
		СистемаВзаимодействия.ИспользованиеДоступно() Тогда

		ПользовательСистемыВзаимодействия = СистемаВзаимодействия.СоздатьПользователя();
		ПользовательСистемыВзаимодействия.ПолноеИмя = Объект.Наименование;
		ПользовательСистемыВзаимодействия.АдресЭлектроннойПочтыДляАутентификации = Объект.ЭлектроннаяПочта;
		ПользовательСистемыВзаимодействия.АдресЭлектроннойПочты = Объект.ЭлектроннаяПочта;
		ПользовательСистемыВзаимодействия.НомерТелефона = Объект.Телефон;
		ПользовательСистемыВзаимодействия.Внешний = Истина;
		ПользовательСистемыВзаимодействия.Записать();

		ИдентификаторПользователяСистемыВзаимодействия = ПользовательСистемыВзаимодействия.Идентификатор;

	КонецЕсли;

КонецПроцедуры

#КонецЕсли

&НаКлиенте
Процедура НовыйРасчетныйСчет(Команда)
	НовыйРасчетныйСчетЗаполнить();
КонецПроцедуры

&НаКлиенте
Асинх Процедура НовыйРасчетныйСчетЗаполнить()
	Если Объект.Ссылка.Пустая() Тогда
		Ждать ПредупреждениеАсинх(НСтр("ru = 'Данные не записаны'", "ru"));
		Возврат;
	КонецЕсли;
	// Подготовка параметров и открытие формы нового расчетного счета контрагента.
	ЗначенияЗаполнения = Новый Структура();
	ЗначенияЗаполнения.Вставить("НаименованиеЗаполнить", "Р/С " + Объект.Наименование);
	ЗначенияЗаполнения.Вставить("Владелец", Объект.Ссылка);
	СтруктураПараметров = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Справочник.РасчетныеСчетаКонтрагентов.ФормаОбъекта", СтруктураПараметров);
КонецПроцедуры

&НаКлиенте
Асинх Функция ПроверитьВозомжностьИПригласитьВОбсуждения()
	Если Не Ждать ПроверитьВозможностьПриглашенияКонтрагентаВСистемуВзаимодействия() Тогда
		Возврат Ложь;
	КонецЕсли;

	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить(1, НСтр("ru = 'Отправить'", "ru"));
	Кнопки.Добавить(2, НСтр("ru = 'Отмена'", "ru"));
	Если ИдентификаторПользователяСистемыВзаимодействия = Неопределено Тогда
		ТекстВопроса = СтрШаблон(НСтр("ru = 'Отправить приглашение на адрес электронной почты ''%1''?'", "ru"), Объект.ЭлектроннаяПочта);
	Иначе
		ТекстВопроса = СтрШаблон(НСтр("ru = 'Пользователь с адресом электронной почты ''%1'' уже приглашен.
									  |
									  |Отправить приглашение повторно?'", "ru"), Объект.ЭлектроннаяПочта);
	КонецЕсли;

	Если Ждать ВопросАсинх(ТекстВопроса, Кнопки, , 1) = 1 Тогда
		Если ПригласитьКонтрагентаВСистемуВзаимодействия() Тогда
			ПоказатьОповещениеПользователя(,, СтрШаблон(НСтр("ru = 'Приглашение отправлено на адрес электронной почты ''%1'''", "ru"), Объект.ЭлектроннаяПочта), БиблиотекаКартинок.ДиалогИнформация);
			Возврат Истина;
		Иначе
			ПоказатьОповещениеПользователя(,, СтрШаблон(НСтр("ru = 'Не удалось отправить приглашение на адрес электронной почты ''%1'''", "ru"), Объект.ЭлектроннаяПочта), БиблиотекаКартинок.ДиалогСтоп);
		КонецЕсли;
	КонецЕсли;   
	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Асинх Процедура ПригласитьВОбсуждения(Команда)
	
	ПроверитьВозомжностьИПригласитьВОбсуждения();

КонецПроцедуры

&НаКлиенте
Асинх Функция ПроверитьВозможностьПриглашенияКонтрагентаВСистемуВзаимодействия()

	Если НЕ СистемаВзаимодействия.ИнформационнаяБазаЗарегистрирована() Тогда
		СистемаВзаимодействияКлиент.ВыполнитьРегистрацию();
		Возврат Ложь;
	КонецЕсли;

	Если НЕ СистемаВзаимодействия.ИспользованиеДоступно() ИЛИ НЕ СистемаВзаимодействия.ПоддерживаетсяВнешнийДоступ() Тогда
		СистемаВзаимодействияКлиент.СообщитьОНевозможностиВнешнегоДоступа();
		Возврат Ложь;
	КонецЕсли;

	Если Объект.Ссылка.Пустая() Тогда
		Ждать ПредупреждениеАсинх(НСтр("ru = 'Данные еще не записаны. Просьба записать.'", "ru"));
		Возврат Ложь;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Ждать ПредупреждениеАсинх(НСтр("ru = 'Просьба заполнить наименование'", "ru"));
		ЭтаФорма.ТекущийЭлемент = Элементы.Наименование;
		Возврат Ложь;
	КонецЕсли;

	Если ПустаяСтрока(Объект.ЭлектроннаяПочта) Тогда
		Ждать ПредупреждениеАсинх(НСтр("ru = 'Просьба заполнить электронную почту'", "ru"));
		ЭтаФорма.ТекущийЭлемент = Элементы.ЭлектроннаяПочта;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаКлиенте
Асинх Процедура ОткрытьОбсуждение(Команда)

	Если Не Ждать ПроверитьДоступностьКонтрагентаВСистемеВзаимодействия() Тогда
		Возврат;
	КонецЕсли;

	ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылкуОбсуждения());

КонецПроцедуры

&НаСервере
Функция ПолучитьНавигационнуюСсылкуОбсуждения()

#Если Не (МобильноеПриложениеСервер Или МобильныйАвтономныйСервер Или ВнешнееСоединение) Тогда
	Обсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
	Обсуждение.Групповое = Ложь;
	Обсуждение.Участники.Добавить(ИдентификаторПользователяСистемыВзаимодействия);
	Обсуждение.Участники.Добавить(СистемаВзаимодействия.ИдентификаторТекущегоПользователя());
	Обсуждение.Записать();
	
	Возврат ПолучитьНавигационнуюСсылку(Обсуждение);
#Иначе
	Возврат Неопределено;
#КонецЕсли

КонецФункции

&НаКлиенте
Асинх Процедура Видеозвонок(Команда)

	Если Не Ждать ПроверитьДоступностьКонтрагентаВСистемеВзаимодействия() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не СистемаВзаимодействия.ПоддерживаютсяВидеоконференции() Тогда
		Ждать ПредупреждениеАсинх(НСтр("ru = 'Система взаимодействия не поддерживает видеоконференции.'", "ru"));
		Возврат;
	КонецЕсли;

	Участники = Новый КоллекцияИдентификаторовПользователейСистемыВзаимодействия();
	Участники.Добавить(СистемаВзаимодействия.ИдентификаторТекущегоПользователя());
	Участники.Добавить(ИдентификаторПользователяСистемыВзаимодействия);

	СистемаВзаимодействия.ВидеоконференцияАсинх(Участники);

КонецПроцедуры

&НаКлиенте
Асинх Функция ПроверитьДоступностьКонтрагентаВСистемеВзаимодействия()

	Если ИдентификаторПользователяСистемыВзаимодействия = Неопределено Тогда
		ТекстВопроса = НСтр("ru = 'Контрагент не приглашен в обсуждение.
										|Пригласить?'", "ru");		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(1, НСтр("ru = 'Пригласить'", "ru"));
		Кнопки.Добавить(2, НСтр("ru = 'Отмена'", "ru"));                                        
		
		Если Ждать ВопросАсинх(ТекстВопроса, Кнопки, , 1) = 1 Тогда
			 Ждать ПроверитьВозомжностьИПригласитьВОбсуждения();
			 Если ИдентификаторПользователяСистемыВзаимодействия = Неопределено Тогда
				 Возврат Ложь;
			 КонецЕсли;
			 Возврат Истина;
		КонецЕсли;
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьПоИНН(Команда)
	
	ИНН = Ждать ВвестиСтрокуАсинх(,"Введите ИНН", 20);
	Если НЕ ЗначениеЗаполнено(ИНН) Тогда
		Возврат;
	КонецЕсли;  
	
	ДанныеКонтрагента = РаботаССервисами.ПолучитьДанныеКонтрагентаИзEГРЮЛ(ИНН);
	Если ДанныеКонтрагента <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Объект, ДанныеКонтрагента);	
	КонецЕсли;
	
	
КонецПроцедуры
